fuseeapspringdsl/fuse-eap-soap/src/main/data/create.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://predic8.com/wsdl/crm/CRMService/1/">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:create>
         <customer>
            <person>
               <id>gero et</id>
               <firstName>sonoras imperio</firstName>
               <lastName>quae divum incedo</lastName>
               <!--Optional:-->
               <address>
                  <street>verrantque per auras</street>
                  <city>per auras</city>
                  <zipCode>circum claustra</zipCode>
                  <country>nimborum in</country>
               </address>
               <age>100</age>
            </person>
            <address>
               <street>foedere certo</street>
               <city>profundum quippe ferant</city>
               <zipCode>et carcere</zipCode>
               <country>iovis rapidum iaculata</country>
               <companyName>speluncis abdidit</companyName>
            </address>
            <id>bella gero et</id>
         </customer>
      </ns:create>
   </soapenv:Body>
</soapenv:Envelope>